package com.example.final_project

object Constants {

    const val USER_NAME: String = "user_name"
    const val TOTAL_QUESTIONS: String = "total_questions"
    const val CORRECT_ANSWERS: String = "correct_answers"

    fun getQuestions():ArrayList<Question>{
        val questionsList = ArrayList<Question>()

        val que1 = Question(
            1,
            "რამდენი შტატია ამერიკაში?",
            "48",
            "49",
            "50",
            "51",
            3)
        questionsList.add(que1)

        val que2 = Question(
            2,
            "რისი ფორმულა არის H2O?",
            "ცეცხლი",
            "წყალი",
            "ნახშიროჟანგი",
            "მხუთავი აირი",
            2)
        questionsList.add(que2)

        val que3 = Question(
            3,
            "ნიუტონის მესამე კანონის თანახმად... ?",
            "F = - F",
            "F = MA",
            "F = M/A",
            "F = A/M",
            1)
        questionsList.add(que3)

        val que4 = Question(
            4,
            "რამდენი მიმდინარეობა აქვს ქრისტინულ რელიგიას?",
            "1",
            "2",
            "3",
            "4",
            2)
        questionsList.add(que4)

        val que5 = Question(
            5,
            "რომელი მდინარე კვეთს ეკვატორს ორჯერ?",
            "კონგო",
            "ნილოსი",
            "ვოლგა",
            "ამაზონი",
            1)
        questionsList.add(que5)

        val que6 = Question(
            6,
            "რომელ წელს დაიწყო პირველი მსოფლიო ომი?",
            "1918",
            "1912",
            "1914",
            "1916",
            3)
        questionsList.add(que6)

        val que7 = Question(
            7,
            "სად მოკლეს ილია?",
            "მტკვრის ნაპირთან",
            "საბადურის ტყესთან",
            "წიფელთან",
            "წიწამურთან",
            4)
        questionsList.add(que7)

        val que8 = Question(
            8,
            "რომელი მეფის დროს იდგა საქართველოში 'ოქროს ხანა'?",
            "ლაშა-გიორგი",
            "გიორგი ბრწყინვალე",
            "თამარ მეფე",
            "დავით მე-4 აღმაშენებელი",
            3)
        questionsList.add(que8)

        val que9 = Question(
            9,
            "რომელი მწერალი არის მიჩნეული დეტექტიური ჟანრის დედოფლად?",
            "შოთა რუსთაველი",
            "აგათა კრისტი",
            "შექსპირი",
            "არტუტ კონან დოილი",
            2)
        questionsList.add(que9)

        val que10 = Question(
            10,
            "f(x) = kx + ?",
            "a/c",
            "a",
            "c",
            "b",
            3)
        questionsList.add(que10)




        return questionsList
    }

    fun getQuestionsForNormal():ArrayList<Question>{
        val questionsList = ArrayList<Question>()

        val que1 = Question(
            1,
            "რომელ დარგში არ გაიცემა ნობელის პრემია?",
            "მათემატიკაში",
            "მედიცინაში",
            "ეკონომიკაში",
            "ფიზიოლოგიაში",
            1)
        questionsList.add(que1)

        val que2 = Question(
            2,
            "ადამიანის რომელ ორგანოში გვხვდება: უზანგი, ჩაქუჩი და გრდემლი?",
            "ყურში",
            "გულში",
            "თირკმელში",
            "ფილტვში",
            1)
        questionsList.add(que2)

        val que3 = Question(
            3,
            "ჩამოთვლილთაგან, რომელია პროექტ „ვიკიპედიის“ ერთ-ერთი ავტორი?",
            "ჯულიან ასანჟი",
            "ჯიმი უელსი",
            "მარკ ცუკერბერგი",
            "არცერთი ჩამოთვლილთაგან",
            2)
        questionsList.add(que3)

        val que4 = Question(
            4,
            "რომელი იყო კაცობრიობის ისტორიაში ფართობით ყველაზე დიდი იმპერია?",
            "რუსეთის იმპერია",
            "ბრიტანეთის იმპერია",
            "ოსმანთა იმპერია",
            "ბიზანტიის იმპერია",
            2)
        questionsList.add(que4)

        val que5 = Question(
            5,
            "თეთრი დათვი ბინადრობს:",
            "არქტიკა",
            "ანტარქტიდა",
            "ანტარქტიკა",
            "არცერთი ჩამოთვლილთაგან",
            1)
        questionsList.add(que5)

        val que6 = Question(
            6,
            "დღე-ღამის განმავლობაში ჟირაფს ძინავს:",
            "6 საათი",
            "12 საათი",
            "8 საათი",
            "2 საათი",
            4)
        questionsList.add(que6)

        val que7 = Question(
            7,
            "ქარის სიჩქარე იზომება:",
            "ბოფორტის სკალით",
            "კორიოლის სკალით",
            "ბარის სკალით",
            "პასკალის სკალით",
            1)
        questionsList.add(que7)

        val que8 = Question(
            8,
            "დედამიწის ღერძი დახრილია:?",
            "23 გრადუსით",
            "8 გრადუსით",
            "0 გრადუსით",
            "17 გრადუსით",
            1)
        questionsList.add(que8)

        val que9 = Question(
            9,
            "ინდოელი ქალის შუბლის ცენტრში დასმულ ფერად წერტილს ჰქვია:",
            "ბინდი",
            "მენდი",
            "შახტი",
            "განდი",
            1)
        questionsList.add(que9)

        val que10 = Question(
            10,
            "საბრძოლო მოქმედებებში ტანკი პირველმა გამოიყენა:",
            "რუსეთმა",
            "ჩინეთმა",
            "აშშ-მ",
            "დიდმა ბრიტანეთმა",
            4)
        questionsList.add(que10)




        return questionsList
    }

    fun getQuestionsForHard():ArrayList<Question>{
        val questionsList = ArrayList<Question>()

        val que1 = Question(
            1,
            "სიტყვათშეთანხმება Assez d'eau (ასსე დო) ფრანგულიდან ითარგმნება როგორც „საკმარისი წყალი“. რომელი ქალაქის სახელწოდებას უკავშირებენ მკვლევარები ამ ფრანგულ სიტყვათშეთანხმებას?",
            "შანჰაი",
            "ოდესა",
            "კარაჩი",
            "მოსკოვი",
            1)
        questionsList.add(que1)

        val que2 = Question(
            2,
            "მურიელ ბარბერის აზრით თანამედროვე დასავლურ ცივილიზაციაში სწორად ეს ნივთი ცვლის კრიალოსანს. ევგენი ბელიკოვმა კი მას „თანამედროვე ოჯახების განხეთქილების ვაშლი“ უწოდა. ყურადღება შეკითხვა: რის შესახებაა საუბარი?",
            "ტელევიზორის პულტის",
            "ტელეფონის",
            "რადიოს",
            "ლეპტოპის",
            1)
        questionsList.add(que2)

        val que3 = Question(
            3,
            "საბჭოთა სპეცსამსახურების დალუქული არქივების პრობლემას მიეძღვნა სტატია, რომლის სათაურიც გვამცნობს, რომ „ისტორიის თავზე დაფრინავენ ისინი“. ყურადღება შეკითხვა: დაასახელეთ ისინი.",
            "გრიფები",
            "ფრანები",
            "მტრედები",
            "ბანკნოტები",
            1)
        questionsList.add(que3)

        val que4 = Question(
            4,
            "არაიაპონელის დაწერილ ერთ თანამედროვე ჰოკუში ფიგურირებს თეთრი ბრინჯი და მასზე მოსხმული სოიოს სოუსი. რომელი ძველი ბერძნული წარმოშობის სიტყვა წარმოადგენს ამ ჰოკუს სათაურს?",
            "იეროგლიფი",
            "ანბანი",
            "ბგერა",
            "ხმოვანი",
            1)
        questionsList.add(que4)

        val que5 = Question(
            5,
            "ეკონომიკის მიმართ ლიბერალური მიდგომის კრიტიკისას სიუზენ ჯორჯმა თქვა, რომ ის ყბაში მოხვდება ყველას, ვინც მას ბრმად ენდობა. ყურადღება შეკითხვა: დაასახელეთ „ის“ ორი სიტყვით.",
            "უხილავი ხელი",
            "უხილავი ფეხი",
            "უხილავი მუშტი",
            "არცერთი ჩამოთვლილთაგან",
            1)
        questionsList.add(que5)

        val que6 = Question(
            6,
            "მეცნიერთა აზრით, ზღვის ფაუნის წარმომადგენლებიდან, რომლის ერთ-ერთი სახეობა არის უკვდავი?",
            "ინფუზორიების",
            "კიბოსნაირების",
            "მოლუსკების",
            "მედუზების",
            4)
        questionsList.add(que6)

        val que7 = Question(
            7,
            "რა ერქვა რუსეთის იმპერიაში დუელში წერილობით გამოწვევას?",
            "ტრესტი",
            "კომპანია",
            "კარტელი",
            "კონცერნი",
            3)
        questionsList.add(que7)

        val que8 = Question(
            8,
            "იცით თუ არა, რამდენი უარყოფითი ნატურალური რიცხვი არსებობს?",
            "არცერთი",
            "სამი",
            "ერთი",
            "უსასრულო რაოდენობით",
            1)
        questionsList.add(que8)

        val que9 = Question(
            9,
            "აქედან რომელი კომპოზიტორია ერთადერთი ოპერის ავტორი?",
            "ბახი",
            "ბეთჰოვენი",
            "სალიერი",
            "ჰენდელი",
            2)
        questionsList.add(que9)

        val que10 = Question(
            10,
            "რას ჩუქნიან ნორვეგიელები ერთმანეთს საახალწლოდ სითბოსა და ბედნიერების ნიშნად?",
            "სანთელს",
            "პლედს",
            "ასანთს",
            "შეშას",
            3)
        questionsList.add(que10)




        return questionsList
    }
}